forcedPlume/run/Allrun.post
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

STATEFILE="paraview/stateFiles/slice_P.pvsm"

pvpython paraview/animationFromStateFile.py -i $STATEFILE -o $OUTNAME -f $FRAMERATE


#------------------------------------------------------------------------------
